КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЗН_Титул4/КонтурЛогистика_ЗН_Титул4.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ЗН_Титул4</name>
  <posting>Deny</posting>
  <attributes>
    <name>УИД_ЗН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЗН</name>
    <comment>Главный документ для ЗН</comment>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектронныйЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИспр</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомИспр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфФщ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфФщ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфФт</name>
    <comment>Дата формирования файла обмена информации Фрахтователя</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфФт</name>
    <comment>Время формирования файла обмена информации Фрахтователя</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфФт</name>
    <comment>Идентификатор файла обмена информации Фрахтователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПФт</name>
    <comment>Электронная подпись файла обмена информации Фрахтователя</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатВрЗавПолТС</name>
    <comment>Фактические дата и время завершения пользования транспортным средством</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмДатВрВыпПрвз</name>
    <comment>Изменение даты и времени выполнения перевозки</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмСрокВыпПрвз</name>
    <comment>Изменение сроков выполнения перевозки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмМршВыпПрвз</name>
    <comment>Изменение маршрута выполнения перевозки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтметкиФрахтовщика</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОтметки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОбстоятельств</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Акты</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктЭтоАктВзвешивания</name>
      <comment>Если истина - то будет отправелен в СвАктВзв. Если ложь - в СвАкт</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АктНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктИдДок</name>
      <comment>Идентификатор файла документа (в том числе регистрационный номер, если документ / сведения о таком документе содержатся в государственных информационных системах)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктДопСведДок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтороныСоставители</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СтороныСоставители</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйСоставитель</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Штрафы</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактКолЕдИзм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогРазмШтрРФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчШтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсправлениеФИОЛиц</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтороныСоставители/КонтурЛогистика_СтороныСоставители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтороныСоставители</name>
  <enumValues>
    <name>ГО</name>
  </enumValues>
  <enumValues>
    <name>ГП</name>
  </enumValues>
  <enumValues>
    <name>ПВ</name>
  </enumValues>
  <enumValues>
    <name>ГОиПВ</name>
  </enumValues>
  <enumValues>
    <name>ГПиПВ</name>
  </enumValues>
  <enumValues>
    <name>ГОиГП</name>
  </enumValues>
  <enumValues>
    <name>ГОиПВиГП</name>
  </enumValues>
  <enumValues>
    <name>Фт</name>
  </enumValues>
  <enumValues>
    <name>Фщ</name>
  </enumValues>
  <enumValues>
    <name>ФтиФщ</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЗН_Титул4/Forms/ФормаДокумента/Module.bsl
// СОБЫТИЯ ФОРМЫ
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДанныеФормы();
	
	РазблокироватьДанныеФормыДляРедактирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// баги старой платформы при отрисовке сложных группировок:
	// в режиме интерфейса 8.2 отображаем в режиме "на отдельных закладках" шапку и тч
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЭтоИнтерфейс82() Тогда 
		ШапкаНаОтдельнойЗакладке = Истина;
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаШапка;
	КонецЕсли;

	УправлениеВидимостьюИДоступностью();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" 
		И 	(Параметр = Объект.Ссылка 
				ИЛИ
			(Параметр <> Неопределено 
			И ТипЗнч(Параметр) = Тип("Массив") 
			И Параметр.Найти(Объект.Ссылка) <> Неопределено)) Тогда 
		
		// ДА КАК ЖЕ ТЕБЯ ОБНОВИТЬ так чтобы требуемые действия отобразились?
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		// пока что это единственный найденный способ, приводящий к обновлению требуемых действий.
		// вот список НЕ работающих (возможно они не считают форму активной, поэтому не работают)
		// Элементы.Товары.Обновить();
		// ОбновитьОтображениеДанных();
		// ОбновитьИнтерфейс();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()
	
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.ДокументЗН, Истина);
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена 
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда 
		ПерешелВЛогистическиеСтатус = Истина;
	Иначе
		ПерешелВЛогистическиеСтатус = Ложь;
	КонецЕсли;
	
	ПерешелВЛогистическиеСтатус = Ложь; // не переходит в логистические статусы
	
	Элементы.ТекущийСтатус.Видимость = Не ПерешелВЛогистическиеСтатус;
	
	ПересчитатьЗаголовкиКоличества();
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Повторно выполнить задачу";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Переотправить неподписанный (черновик)";
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Выполнить задачу";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Отправить неподписанный (черновик)";
	КонецЕсли;

	ЭтоВходящий = ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен;
	ЕстьДокУчСист = ЗначениеЗаполнено(Объект.ДокументОснование);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
		ДоступнаОсновнаяКнопкаПоУмолчанию = Истина;
	Иначе
		ДоступнаОсновнаяКнопкаПоУмолчанию = Ложь;
	КонецЕсли;
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость = ДоступнаОсновнаяКнопкаПоУмолчанию;
	
	Элементы.ПользовательПодписант.Видимость = НЕ ЭтоВходящий;
	
	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка, Объект.ДокументОснование, Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, ТекущийСтатус);
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЗаголовкиКоличества()
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);
	
	УправлениеВидимостьюИДоступностью(); 	// доступность команд
	
	Возврат РезультатПроверки;
		
КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_ЗН_Титул4.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат РезультатПроверки;
	
КонецФункции

// УПРАВЛЕНИЕ ВИДИМОСТЬЮ И ДОСТУПНОСТЬЮ
&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	УстановитьПоложениеСохраняемыхЭлементов();

	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	//
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоложениеСохраняемыхЭлементов()
	
	УстановитьПоложениеШапки();

КонецПроцедуры

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьОбъект(Команда)
	
	ОбработчикПеречитатьОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()
	
	ЭтаФорма.Прочитать();
	ПолностьюОбновитьПредставлениеДанных();
	ОбновитьДанныеФормы();

КонецПроцедуры

&НаКлиенте
Процедура ПолностьюОбновитьПредставлениеДанных()

	//УстановитьТипыЗначенийРеквизитов(); // TODO
	
	ОповеститьОбИзменении(Объект.ДокументЗН);
	
	ПроверитьДокумент(); // вызовет УправлениеВидимостьюИДоступностью();
	
КонецПроцедуры

// КОМАНДЫ ФОРМЫ

&НаКлиенте
Процедура СвернутьШапку(Команда)
	
	ШапкаНаОтдельнойЗакладке = Истина;
	УстановитьПоложениеШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьШапку(Команда)
	
	ШапкаНаОтдельнойЗакладке = Ложь;
	УстановитьПоложениеШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоложениеШапки()
	
	Если ШапкаНаОтдельнойЗакладке Тогда
		
		текАктивнаяЗакладка = Элементы.Страницы.ТекущаяСтраница;
		
		ПереместитьШапкуВызовСервера();
		//Элементы.Переместить(Элементы.ГруппаШапкаЛево, Элементы.СтраницаШапка);
		Элементы.СвернутьШапку.Видимость = Ложь;
		Элементы.РазвернутьШапку.Видимость = Истина;
		
		ПанельОшибокРазвернута = Элементы.ПанельОшибок.РастягиватьПоВертикали;
		Если Не ПанельОшибокРазвернута Тогда 
			ПанельОшибокСвернутьРазвернутьВызовОМ();
		КонецЕсли;
		                                             
		Элементы.Страницы.ТекущаяСтраница = текАктивнаяЗакладка;
		
	Иначе
		
		ПереместитьШапкуВызовСервера();
		//Элементы.Переместить(Элементы.ГруппаШапкаЛево, Элементы.ГруппаШапкаМестоположение);
		Элементы.СвернутьШапку.Видимость = Истина;
		Элементы.РазвернутьШапку.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПереместитьШапкуВызовСервера()
	
	Если ШапкаНаОтдельнойЗакладке Тогда
		КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма, Элементы.ГруппаШапкаДанные, Элементы.СтраницаШапка);
	Иначе
		КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма, Элементы.ГруппаШапкаДанные, Элементы.ГруппаШапкаМестоположение);
	КонецЕсли;

КонецПроцедуры
	
&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокСвернутьРазвернуть(Команда)
	
	ПанельОшибокСвернутьРазвернутьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьВызовОМ()
	
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьНаСервере()
	
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
	
КонецПроцедуры

// Обработчики для требуемых действий

&НаКлиенте
Процедура ОбработатьТребуемоеДействие(ТребуемоеДействие, ПолеТаблицыОшибок = Неопределено)
	
	// реализуем отдельную обработку некоторых требуемых действий
	Если Ложь Тогда // Какие-то особенные UI для требуемых действий, например: ТребуемоеДействие = "Исправить GTIN" Тогда
		
	Иначе // типовая обработка таблицы ошибок
		
		Если ПолеТаблицыОшибок <> Неопределено Тогда
			КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, ПолеТаблицыОшибок.Имя);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		
		Элементы.Акты.ОтборСтрок 			= Неопределено;
		Элементы.Штрафы.ОтборСтрок 			= Неопределено;
		
	Иначе
		
		Элементы.Акты.ОтборСтрок 			= Новый ФиксированнаяСтруктура("ИдентификаторСтрокиОтметки", Элемент.ТекущиеДанные.ИдентификаторСтроки);    
		Элементы.Штрафы.ОтборСтрок 			= Новый ФиксированнаяСтруктура("ИдентификаторСтрокиОтметки", Элемент.ТекущиеДанные.ИдентификаторСтроки);    
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.Отметки.ТекущиеДанные = Неопределено Тогда 
		
		Отказ = Истина;
		Сообщить("Сначала добавьте слева строку отметки, к которой будет относиться акт");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда 
		
		ТекОтметка = Элементы.Отметки.ТекущиеДанные;
		
		Если ТекОтметка <> Неопределено Тогда 
			
			Элемент.ТекущиеДанные.ИдентификаторСтрокиОтметки = ТекОтметка.ИдентификаторСтроки;
			Элемент.ТекущиеДанные.АктДата = ТекущаяДата();
			Элемент.ТекущиеДанные.АктНаименование = "Акт";
			Элемент.ТекущиеДанные.СтороныСоставители = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтороныСоставители.Фт");
			
		КонецЕсли
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрафыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.Отметки.ТекущиеДанные = Неопределено Тогда 
		
		Отказ = Истина;
		Сообщить("Сначала добавьте Отметку, к которой будет относиться акт");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрафыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда 
		
		ТекОтметка = Элементы.Отметки.ТекущиеДанные;
		
		Если ТекОтметка <> Неопределено Тогда 
			
			Элемент.ТекущиеДанные.ИдентификаторСтрокиОтметки = ТекОтметка.ИдентификаторСтроки;
			
		КонецЕсли
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда 
		
		Элемент.ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		Элемент.ТекущиеДанные.ДатаИВремяОтметки = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ТекущийМоментВремени();
		
	КонецЕсли
		
КонецПроцедуры

&НаКлиенте
Процедура ДатВрЗавПолТСПриИзменении(Элемент)
	Перепроверить();
КонецПроцедуры

&НаКлиенте
Процедура ИзмДатВрВыпПрвзПриИзменении(Элемент)
	Перепроверить();
КонецПроцедуры

&НаКлиенте
Процедура ИзмСрокВыпПрвзПриИзменении(Элемент)
	Перепроверить();
КонецПроцедуры

&НаКлиенте
Процедура ИзмМршВыпПрвзПриИзменении(Элемент)
	Перепроверить();
КонецПроцедуры
